#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<math.h>

/*
4-Homework-10
计算某企业发放的奖金.
*/

int main()
{
	double I,R;//利润I与奖金R
	scanf("%lf", &I);
	if (I >= 0 && I <= 100000)
		R = I * 0.1;
	else if (I > 100000 && I <= 200000)
		R = 100000 * 0.1 + (I - 100000) * 0.075;
	else if (I > 200000 && I <= 400000)
		R = 100000 * 0.1 + 100000 * 0.075 + (I - 200000) * 0.05;
	else if (I > 400000 && I <= 600000)
		R = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + (I - 400000) * 0.03;
	else if (I > 600000 && I <= 1000000)
		R = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + (I - 600000) * 0.015;
	else if (I > 1000000)
		R = 100000 * 0.1 + 100000 * 0.075 + 200000 * 0.05 + 200000 * 0.03 + 400000 * 0.015 + (I - 1000000) * 0.01;
	else
		printf("请重新输入\n");
	printf("奖金为%.2lf元\n", R);
	return 0;
}